CSI API ETABS v1
cAnalysisResults.AreaStressShellLayered Method
 Reports the area stresses for the specified area elements that are assigned layered shell section properties
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int AreaStressShellLayered(
	string Name,
	eItemTypeElm ItemTypeElm,
	ref int NumberResults,
	ref string[] Obj,
	ref string[] Elm,
	ref string[] Layer,
	ref int[] IntPtNum,
	ref double[] IntPtLoc,
	ref string[] PointElm,
	ref string[] LoadCase,
	ref string[] StepType,
	ref double[] StepNum,
	ref double[] S11,
	ref double[] S22,
	ref double[] S12,
	ref double[] SMax,
	ref double[] SMin,
	ref double[] SAngle,
	ref double[] SVM,
	ref double[] S13Avg,
	ref double[] S23Avg,
	ref double[] SMaxAvg,
	ref double[] SAngleAvg
)
Function AreaStressShellLayered (
	Name As String,
	ItemTypeElm As eItemTypeElm,
	ByRef NumberResults As Integer,
	ByRef Obj As String(),
	ByRef Elm As String(),
	ByRef Layer As String(),
	ByRef IntPtNum As Integer(),
	ByRef IntPtLoc As Double(),
	ByRef PointElm As String(),
	ByRef LoadCase As String(),
	ByRef StepType As String(),
	ByRef StepNum As Double(),
	ByRef S11 As Double(),
	ByRef S22 As Double(),
	ByRef S12 As Double(),
	ByRef SMax As Double(),
	ByRef SMin As Double(),
	ByRef SAngle As Double(),
	ByRef SVM As Double(),
	ByRef S13Avg As Double(),
	ByRef S23Avg As Double(),
	ByRef SMaxAvg As Double(),
	ByRef SAngleAvg As Double()
) As Integer
Dim instance As cAnalysisResults
Dim Name As String
Dim ItemTypeElm As eItemTypeElm
Dim NumberResults As Integer
Dim Obj As String()
Dim Elm As String()
Dim Layer As String()
Dim IntPtNum As Integer()
Dim IntPtLoc As Double()
Dim PointElm As String()
Dim LoadCase As String()
Dim StepType As String()
Dim StepNum As Double()
Dim S11 As Double()
Dim S22 As Double()
Dim S12 As Double()
Dim SMax As Double()
Dim SMin As Double()
Dim SAngle As Double()
Dim SVM As Double()
Dim S13Avg As Double()
Dim S23Avg As Double()
Dim SMaxAvg As Double()
Dim SAngleAvg As Double()
Dim returnValue As Integer
returnValue = instance.AreaStressShellLayered(Name,
	ItemTypeElm, NumberResults, Obj,
	Elm, Layer, IntPtNum, IntPtLoc, PointElm,
	LoadCase, StepType, StepNum, S11,
	S22, S12, SMax, SMin, SAngle, SVM, S13Avg,
	S23Avg, SMaxAvg, SAngleAvg)
int AreaStressShellLayered(
	String^ Name,
	eItemTypeElm ItemTypeElm,
	int% NumberResults,
	array<String^>^% Obj,
	array<String^>^% Elm,
	array<String^>^% Layer,
	array<int>^% IntPtNum,
	array<double>^% IntPtLoc,
	array<String^>^% PointElm,
	array<String^>^% LoadCase,
	array<String^>^% StepType,
	array<double>^% StepNum,
	array<double>^% S11,
	array<double>^% S22,
	array<double>^% S12,
	array<double>^% SMax,
	array<double>^% SMin,
	array<double>^% SAngle,
	array<double>^% SVM,
	array<double>^% S13Avg,
	array<double>^% S23Avg,
	array<double>^% SMaxAvg,
	array<double>^% SAngleAvg
)
abstract AreaStressShellLayered :
        Name : string *
        ItemTypeElm : eItemTypeElm *
        NumberResults : int byref *
        Obj : string[] byref *
        Elm : string[] byref *
        Layer : string[] byref *
        IntPtNum : int[] byref *
        IntPtLoc : float[] byref *
        PointElm : string[] byref *
        LoadCase : string[] byref *
        StepType : string[] byref *
        StepNum : float[] byref *
        S11 : float[] byref *
        S22 : float[] byref *
        S12 : float[] byref *
        SMax : float[] byref *
        SMin : float[] byref *
        SAngle : float[] byref *
        SVM : float[] byref *
        S13Avg : float[] byref *
        S23Avg : float[] byref *
        SMaxAvg : float[] byref *
        SAngleAvg : float[] byref -> int
Parameters
Name
Type: System.String
 The name of an existing area object, area element or group of objects, depending on the value of the ItemTypeElm item
ItemTypeElm
Type: ETABSv1.eItemTypeElm
 This is one of the following items in the eItemTypeElm enumeration.
 If this item is ObjectElm, the result request is for the area elements corresponding to the area object specified by the Name item.
 If this item is Element, the result request is for the area element specified by the Name item.
 If this item is GroupElm, the result request is for the area elements corresponding to all area objects included in the group specified by the Name item.
 If this item is SelectionElm, the result request is for area elements corresponding to all selected area objects and the Name item is ignored.
NumberResults
Type: System.Int32
 The total number of results returned by the program
Obj
Type: System.String[]
 This is an array that includes the area object name associated with each result, if any
Elm
Type: System.String[]
 This is an array that includes the area element name associated with each result
Layer
Type: System.String[]
 This is an array that includes the layer name associated with each result
IntPtNum
Type: System.Int32[]
 This is an array that includes the integration point number within the specified layer of the area element
IntPtLoc
Type: System.Double[]
 This is an array that includes the integration point relative location within the specified layer of the area element. The location is between -1 (bottom of layer) and +1 (top of layer), inclusive. The midheight of the layer is at a value of 0
PointElm
Type: System.String[]
 This is an array that includes the name of the point element where the results are reported
LoadCase
Type: System.String[]
 This is an array that includes the name of the analysis case or load combination associated with each result
StepType
Type: System.String[]
 This is an array that includes the step type, if any, for each result
StepNum
Type: System.Double[]
 This is an array that includes the step number, if any, for each result
S11
Type: System.Double[]
 The area element internal S11 stress at the specified point element location, for the specified layer and layer integration point, reported in the area element local coordinate system. [F/L2]
S22
Type: System.Double[]
 The area element internal S22 stress at the specified point element location, for the specified layer and layer integration point, reported in the area element local coordinate system. [F/L2]
S12
Type: System.Double[]
 The area element internal S12 stress at the specified point element location, for the specified layer and layer integration point, reported in the area element local coordinate system. [F/L2]
SMax
Type: System.Double[]
 The area element maximum principal stress at the specified point element location, for the specified layer and layer integration point. [F/L2]
SMin
Type: System.Double[]
 The area element minimum principal stress at the specified point element location, for the specified layer and layer integration point. [F/L2]
SAngle
Type: System.Double[]
 The angle measured counter clockwise (when the local 3 axis is pointing toward you) from the area local 1 axis to the direction of the maximum principal stress. [deg]
SVM
Type: System.Double[]
 The area element internal Von Mises stress at the specified point element location, for the specified layer and layer integration point. [F/L2]
S13Avg
Type: System.Double[]
 The area element average S13 out-of-plane shear stress at the specified point element location, for the specified layer and layer integration point. [F/L2]
S23Avg
Type: System.Double[]
 The area element average S23 out-of-plane shear stress at the specified point element location, for the specified layer and layer integration point. [F/L2]
SMaxAvg
Type: System.Double[]
 The area element maximum average out-of-plane shear stress for the specified layer and layer integration point. It is equal to the square root of the sum of the squares of S13Avg and S23Avg. [F/L2]
SAngleAvg
Type: System.Double[]
 The angle measured counter clockwise (when the local 3 axis is pointing toward you) from the area local 1 axis to the direction of SMaxAvg. [deg]
Return Value
Type: Int32
 Returns zero if the stresses are successfully recovered, otherwise it returns a nonzero value
Remarks
 See Results for more information.
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
       Dim MyNumberLayers As Integer
       Dim MyLayerName() As String
       Dim MyDist() As Double
       Dim MyThickness() As Double
       Dim MyType() As Integer
       Dim MyNumIntegrationPts() As Integer
       Dim MyMatProp() As String
       Dim MyMatAng() As Double
       Dim MyS11Type() As Integer
       Dim MyS22Type() As Integer
       Dim MyS12Type() As Integer
       Dim NumberResults As Integer
       Dim Obj() As String
       Dim ObjSta() As Double
       Dim Elm() As String
       Dim ElmSta() As Double
       Dim LoadCase() As String
       Dim StepType() As String
       Dim StepNum() As Double
       Dim S11() As Double
       Dim S22() As Double
       Dim S12() As Double
       Dim SMax() As Double
       Dim SMin() As Double
       Dim SAngle() As Double
       Dim SVM() As Double
       Dim SVMBot() As Double
       Dim S13Avg() As Double
       Dim S23Avg() As Double
       Dim SMaxAvg() As Double
       Dim SAngleAvg() As Double
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)
   'set new area property
       ret = SapModel.PropArea.SetSlab("A1", eSlabType.Slab, eShellType.Layered, "4000Psi", 16.0)
   'add A615Gr60 rebar material
       ret = SapModel.PropMaterial.AddMaterial(Name, eMatType.Rebar, "United States", "ASTM A615", "Grade 60")
   'set area property layer parameters
       MyNumberLayers = 5
       ReDim MyLayerName(MyNumberLayers - 1)
       ReDim MyDist(MyNumberLayers - 1)
       ReDim MyThickness(MyNumberLayers - 1)
       ReDim MyType(MyNumberLayers - 1)
       ReDim MyNumIntegrationPts(MyNumberLayers - 1)
       ReDim MyMatProp(MyNumberLayers - 1)
       ReDim MyMatAng(MyNumberLayers - 1)
       ReDim MyS11Type(MyNumberLayers - 1)
       ReDim MyS22Type(MyNumberLayers - 1)
       ReDim MyS12Type(MyNumberLayers - 1)
       MyLayerName(0) = "Concrete"
       MyDist(0) = 0
       MyThickness(0) = 16
       MyType(0) = 1
       MyNumIntegrationPts(0) = 2
       MyMatProp(0) = "4000Psi"
       MyMatAng(0) = 0
       MyS11Type(0) = 1
       MyS22Type(0) = 1
       MyS12Type(0) = 1
       MyLayerName(1) = "Top Bar 1"
       MyDist(1) = 6
       MyThickness(1) = 0.03
       MyType(1) = 1
       MyNumIntegrationPts(1) = 1
       MyMatProp(1) = Name
       MyMatAng(1) = 0
       MyS11Type(1) = 1
       MyS22Type(1) = 1
       MyS12Type(1) = 1
       MyLayerName(2) = "Top Bar 2"
       MyDist(2) = 6
       MyThickness(2) = 0.03
       MyType(2) = 1
       MyNumIntegrationPts(2) = 1
       MyMatProp(2) = Name
       MyMatAng(2) = 90
       MyS11Type(2) = 1
       MyS22Type(2) = 1
       MyS12Type(2) = 1
       MyLayerName(3) = "Bot Bar 1"
       MyDist(3) = -6
       MyThickness(3) = 0.03
       MyType(3) = 1
       MyNumIntegrationPts(3) = 1
       MyMatProp(3) = Name
       MyMatAng(3) = 0
       MyS11Type(3) = 1
       MyS22Type(3) = 1
       MyS12Type(3) = 1
       MyLayerName(4) = "Bot Bar 2"
       MyDist(4) = -6
       MyThickness(4) = 0.03
       MyType(4) = 1
       MyNumIntegrationPts(4) = 1
       MyMatProp(4) = Name
       MyMatAng(4) = 90
       MyS11Type(4) = 1
       MyS22Type(4) = 1
       MyS12Type(4) = 1
       ret = SapModel.PropArea.SetShellLayer_1("A1", MyNumberLayers, MyLayerName, MyDist, MyThickness, MyType, MyNumIntegrationPts, MyMatProp, MyMatAng, MyS11Type, MyS22Type, MyS12Type)
   'set area property
       ret = SapModel.AreaObj.SetProperty("4", "A1")
   'run analysis
       System.IO.Directory.CreateDirectory("c:\CSI_API_temp")
       ret = SapModel.File.Save("C:\CSI_API_temp\example.edb")
       ret = SapModel.Analyze.RunAnalysis()
   'deselect all cases and combos
       ret = SapModel.Results.Setup.DeselectAllCasesAndCombosForOutput()
   'set case selected for output
       ret = SapModel.Results.Setup.SetCaseSelectedForOutput("DEAD")
   'get area stresses for area object "4"
       ret = SapModel.Results.AreaStressShellLayered("4", eItemTypeElm.ObjectElm, NumberResults, Obj, Elm, Layer, IntPtNum, IntPtLoc, PointElm, LoadCase, StepType, StepNum, S11, S22, S12, SMax, SMin, SAngle, SVM, S13Avg, S23Avg, SMaxAvg, SAngleAvg)
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cAnalysisResults Interface
ETABSv1 Namespace